Point of Sale System/app/Controllers/Main.php

SELECT *
FROM `users`
WHERE `id` != '1'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` != '1'
---
    public function users(){
        $this->data['page_title']="Users";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->auth_model->where("id != '{$this->session->login_id}'")->countAllResults();
        $this->data['users'] = $this->auth_model->where("id != '{$this->session->login_id}'")->paginate($this->data['perPage']);

SELECT *
FROM `products`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function products(){
        $this->data['page_title']="Products";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->prod_model->countAllResults();
        $this->data['products'] = $this->prod_model->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `transactions`
---
    public function transactions(){
        $this->data['page_title']="Transactions";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->tran_model->countAllResults();
        $this->data['transactions'] = $this->tran_model
                                    ->select(" transactions.*, COALESCE((SELECT SUM(transaction_items.quantity) FROM transaction_items where transaction_id = transactions.id ), 0) as total_items")
                                    ->paginate($this->data['perPage']);

SELECT `transaction_items`.*, CONCAT(products.code, '-', products.name) as product
FROM `transaction_items`
INNER JOIN `products` ON `transaction_items`.`product_id` = `products`.`id`
WHERE `transaction_id` = '1'
---
    public function transaction_view($id=''){
        if(empty($id)){
            $this->session->setFlashdata('main_error',"Transaction Details failed to load due to unknown ID.");
            return redirect()->to('Main/transactions');
        }
        $this->data['page_title']="Transactions";
        $this->data['details'] = $this->tran_model->where('id', $id)->first();
        if(!$this->data['details']){
            $this->session->setFlashdata('main_error',"Transaction Details failed to load due to unknown ID.");
            return redirect()->to('Main/transactions');
        }
        $this->data['items'] = $this->tran_item_model
                                ->select("transaction_items.*, CONCAT(products.code,'-',products.name) as product")
                                ->where('transaction_id', $id)
                                ->join('products', " transaction_items.product_id = products.id ", 'inner')
                                ->findAll();