Student Management System/app/Controllers/Main.php

SELECT *
FROM `users`
WHERE `id` != '3'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` != '3'
---
    public function users(){
        if($this->session->login_type != 1){
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        $this->data['page_title']="Users";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->auth_model->where("id != '{$this->session->login_id}'")->countAllResults();
        $this->data['users'] = $this->auth_model->where("id != '{$this->session->login_id}'")->paginate($this->data['perPage']);

SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1
---
    public function user_edit($id=''){
        if($this->session->login_type != 1){
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        if(empty($id))
        return redirect()->to('Main/users');
        if($this->request->getMethod() == 'post'){
            extract($this->request->getPost());
            if($password !== $cpassword){
                $this->session->setFlashdata('error',"Password does not match.");
            }else{
                $udata= [];
                $udata['name'] = $name;
                $udata['email'] = $email;
                $udata['type'] = $type;
                $udata['status'] = $status;
                if(!empty($password))
                $udata['password'] = password_hash($password, PASSWORD_DEFAULT);
                $update = $this->auth_model->where('id',$id)->set($udata)->update();
                if($update){
                    $this->session->setFlashdata('success',"User Details has been updated successfully.");
                    return redirect()->to('Main/user_edit/'.$id);
                }else{
                    $this->session->setFlashdata('error',"User Details has failed to update.");
                }
            }
        }

        $this->data['page_title']="Users";
        $this->data['user'] = $this->auth_model->where("id ='{$id}'")->first();