Blog App/app/Controllers/Auth.php


        $this->data['session']=$session;
        $this->data['page_title']="Users";
        $this->data['user'] = $this->auth_model->where("id ='{$session->login_id}'")->first();
---
SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1