Employees Payroll Management/app/Controllers/Main.php

    public function index()
    {
        $this->data['page_title']="Home";
        $this->data['departments']=$this->dept_model->countAll();
        $this->data['designations']=$this->desg_model->countAll();
        $this->data['employees']=$this->emp_model->countAll();
        $this->data['payrolls']=$this->payroll_model->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `departments`
SELECT COUNT(*) AS `numrows` FROM `designations`
SELECT COUNT(*) AS `numrows` FROM `employees`
SELECT COUNT(*) AS `numrows` FROM `payrolls`

    public function payslips(){
        $this->data['page_title']="Payslips";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->payslip_model->countAllResults();
        $this->data['payslips'] = $this->payslip_model
                                        ->select("`payslips`.*, CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) as `employee_name`, employees.code as employee_code, payrolls.code as payroll_code, payrolls.title as payroll_name")
                                        ->join('payrolls'," payslips.payroll_id = payrolls.id ",'inner')
                                        ->join('employees'," payslips.employee_id = employees.id ",'inner')
                                        ->paginate($this->data['perPage']);
---
SELECT COUNT(*) AS `numrows`
FROM `payslips`
SELECT COUNT(*) AS `numrows`
FROM `payslips`
INNER JOIN `payrolls` ON `payslips`.`payroll_id` = `payrolls`.`id`
INNER JOIN `employees` ON `payslips`.`employee_id` = `employees`.`id`
SELECT `payslips`.*, CONCAT(employees.last_name, ', ', `employees`.`first_name`, COALESCE(CONCAT(' ', employees.middle_name), '')) as `employee_name`, `employees`.`code` as `employee_code`, `payrolls`.`code` as `payroll_code`, `payrolls`.`title` as `payroll_name`
FROM `payslips`
INNER JOIN `payrolls` ON `payslips`.`payroll_id` = `payrolls`.`id`
INNER JOIN `employees` ON `payslips`.`employee_id` = `employees`.`id`
 LIMIT 10

    public function payslip_add(){
        if($this->request->getMethod() == 'post'){
            extract($this->request->getPost());
            $udata= [];
            foreach($this->request->getPost() as $k => $v){
                if(!is_array($this->request->getPost($k)))
                $udata[$k] = $v;
            }
            $checkCode = $this->payslip_model->where('employee_id',$employee_id)->where('payroll_id',$payroll_id)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `payslips`
WHERE `employee_id` = '27'
AND `payroll_id` = '1'

                }
            }
        }
        $this->data['employees'] = $this->emp_model->select("*, CONCAT(employees.last_name, ',', employees.first_name, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`")->findAll();
        $this->data['payrolls'] = $this->payroll_model->findAll();
---
SELECT *, CONCAT(employees.last_name, ', ', `employees`.`first_name`, COALESCE(CONCAT(' ', employees.middle_name), '')) as `name`
FROM `employees`
SELECT *
FROM `payrolls`